Обработки/Reports/_РасшифровкаКурсовойРазницы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_РасшифровкаКурсовойРазницы</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подписант</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЮрФизЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыУчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_РасшифровкаКурсовойРазницы/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет, 
		"Расшифровка курсовой разницы", 
		"0.10", 
		"", 
		Истина);
	
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Функция ПолучитьДанныеШапки()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	КлиентыДоверительногоУправленияСрезПоследних.Клиент,
		|	СчетаДоверительногоУправления.НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаДоговора
		|ИЗ
		|	РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&Период, ) КАК КлиентыДоверительногоУправленияСрезПоследних
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ПО КлиентыДоверительногоУправленияСрезПоследних.СчетДоверительногоУправления = СчетаДоверительногоУправления.Ссылка
		|ГДЕ
		|	СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления";
	
	
	Запрос.УстановитьПараметр("Период", ЭтотОбъект.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		
		Возврат ВыборкаДетальныеЗаписи;
		
	КонецЕсли;
	
КонецФункции
 
Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
	
	Настройки = КомпоновщикНастроек.Настройки;
	
	
	Если ЭтотОбъект.ВидУчета = Перечисления.ВидыУчета.БухгалтерскийУчет Тогда 
		ТекстЗапроса = СхемаКомпоновкиДанных.НаборыДанных[0].Запрос;
		ТекстЗапроса = СтрЗаменить(ТекстЗапроса, "НалоговыйУчет", "БухгалтерскийУчет");
		СхемаКомпоновкиДанных.НаборыДанных[0].Запрос = ТекстЗапроса;
	КонецЕсли;	
	
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаНачальная", ЭтотОбъект.Период.ДатаНачала);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонечная", Новый Граница(ЭтотОбъект.Период.ДатаОкончания, ВидГраницы.Включая));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаКонечнаяДата", ЭтотОбъект.Период.ДатаОкончания);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Организация", ЭтотОбъект.Организация);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("СчетДоверительногоУправления", ЭтотОбъект.СчетДоверительногоУправления);
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("Рубль", ОбщегоНазначения.ПолучитьИменованныйОбъект("Валюта_Российский_рубль"));
	Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ВидУчета", ЭтотОбъект.ВидУчета);

		
	ДанныеШапки = ПолучитьДанныеШапки();
	Если НЕ ДанныеШапки = Неопределено Тогда
	
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ДатаДоговора", 				Формат(ДанныеШапки.ДатаДоговора, "ДФ=dd.MM.yyyy"));
		Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("НомерДоговора", 				ДанныеШапки.НомерДоговора);
			
	КонецЕсли; 
			
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	
	РаботаСОтчетами.ВыполнитьКомпоновкуПрограммно(ЭтотОбъект,ДокументРезультат,ДанныеРасшифровки,СтандартнаяОбработка,ПараметрыВыводаПодписей);
	
КонецПроцедуры
